app/controllers/dashboard_controller.rb

SELECT "patients".* FROM "patients"
SELECT COUNT(*) AS "count_all", DATE_TRUNC('day', "patients"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date AS "date_trunc_day_patients_created_at_timestamptz_at_time_zone_etc" FROM "patients" WHERE ("patients"."created_at" IS NOT NULL) GROUP BY DATE_TRUNC('day', "patients"."created_at"::timestamptz AT TIME ZONE 'Etc/UTC')::date
---
  def index
    if current_user.doctor?
      @patients_appointed = current_user.doctor_appointments
      @patients = Patient.all
      @patients_count_by_day = @patients.group_by_day(:created_at).count