app/controllers/doctor_appointments_controller.rb

  def index
    @doctor_appointments = DoctorAppointment.all
---
SELECT "doctor_appointments".* FROM "doctor_appointments"

  def new
    @doctors = User.where(role: 'Doctor')
    @patients = Patient.all
---
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "Doctor"]]
SELECT "patients".* FROM "patients"

  def create
    @doctor_appointment = DoctorAppointment.new(doctor_appointment_params)

    respond_to do |format|
      if @doctor_appointment.save
        format.html { redirect_to authenticated_root_path, notice: 'Doctor appointment was successfully created.' }
        format.json { render :show, status: :created, location: @doctor_appointment }
      else
        @doctors = User.where(role: 'doctor')
        @patients = Patient.all
---
INSERT INTO "doctor_appointments" ("user_id", "patient_id", "date", "illness", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["patient_id", 1], ["date", "2024-04-30"], ["illness", "Headache "], ["created_at", "2024-04-20 23:05:17.046257"], ["updated_at", "2024-04-20 23:05:17.046257"]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "doctor"]]
SELECT "patients".* FROM "patients"

  def destroy
    @doctor_appointment.patient.destroy # This will delete the patient and all associated doctor appointments
---
DELETE FROM "doctor_appointments" WHERE "doctor_appointments"."id" = $1  [["id", 1]]
DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 3]]

  def set_doctor_appointment
    @doctor_appointment = DoctorAppointment.find(params[:id])
---
SELECT "doctor_appointments".* FROM "doctor_appointments" WHERE "doctor_appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]