app/controllers/patients_controller.rb

INSERT INTO "patients" ("first_name", "last_name", "age", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Daniel"], ["last_name", "Ugochukwu"], ["age", "23"], ["address", "Amaetiti Achi"], ["created_at", "2024-04-18 17:38:13.103548"], ["updated_at", "2024-04-18 17:38:13.103548"]]
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

UPDATE "patients" SET "address" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["address", "India Austria"], ["updated_at", "2024-04-20 23:51:11.966308"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @patient.update(patient_params)

DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 1]]
---
  def destroy
    @patient.destroy