app/views/doctor_appointments/_doctor_appointment.html.erb

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  <td class="text-center">
    <%= doctor_appointment.patient.first_name %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  <td class="text-center">
    <%= doctor_appointment.user.first_name %>